#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-5SBzwBPw5SrsdaUg

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_instance.composer_internal: Refreshing state... [id=i-0a68c4943aff51cfe]
aws_instance.composer_external: Refreshing state... [id=i-08e50f4484ed22b9a]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2907417618]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-1173148770]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-3b3c9647-29f2-4dbd-be71-26305028634c]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-dc578ae3-3d2d-4c48-96b9-699f00ab7cb4]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_security_group.external_vpc_endpoints must be replaced
+/- resource "aws_security_group" "external_vpc_endpoints" {
      ~ arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-0be443e4c92c98b1c" -> (known after apply)
      ~ description            = "Allow ingress traffic" -> "External VPC endpoints" # forces replacement
      ~ id                     = "sg-0be443e4c92c98b1c" -> (known after apply)
        name                   = "external_vpc_endpoints_staging"
      ~ owner_id               = "933752197999" -> (known after apply)
        tags                   = {
            "AppCode"      = "IMGB-001"
            "Name"         = "external_vpc_endpoints_staging"
            "ServiceOwner" = "Image Builder"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.external_vpc_cloudwatch_logs will be updated in-place
  ~ resource "aws_vpc_endpoint" "external_vpc_cloudwatch_logs" {
        id                    = "vpce-0ffb71834c608a4e5"
      ~ security_group_ids    = [
          - "sg-0be443e4c92c98b1c",
        ] -> (known after apply)
        tags                  = {
            "AppCode"      = "IMGB-001"
            "Name"         = "📜 CloudWatch Logs VPC endpoint (external)"
            "ServiceOwner" = "Image Builder"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.external_vpc_secretsmanager will be updated in-place
  ~ resource "aws_vpc_endpoint" "external_vpc_secretsmanager" {
        id                    = "vpce-013676c2939c3d681"
      ~ security_group_ids    = [
          - "sg-0be443e4c92c98b1c",
        ] -> (known after apply)
        tags                  = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🤫 Secrets Manager VPC endpoint (external)"
            "ServiceOwner" = "Image Builder"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*